
# https://docs.nginx.com/nginx/admin-guide/basic-functionality/

# ==============================================================================================================================
# CONFIG
# ==============================================================================================================================
/etc/nginx/nginx.conf             # конфиг nginx
/var/run/nginx.pid                # pid 

http {
    upstream backend {
        server backend1.example.com weight=5;
        server backend2.example.com;
        server 192.0.0.1 backup;
    }
}

# ==============================================================================================================================
# CACHE, Gzip
# ==============================================================================================================================
# кешировать нужно статику
# немнужно кешировать админку и запросы POST 

# в location скажет браузеру кешировать страницу на месяц
expires 1M;   

# в server https://www.youtube.com/watch?v=Z24wGMmsH4Q&list=PLhgRAQ8BwWFa7ulOkX0qi5UfVizGD_-Rc&index=17
gzip on;

# ==============================================================================================================================
# LOGGING
# ==============================================================================================================================
# настройки логов могут быть определены глобально, на уровне, сервера и location.
# логирование статики обычно отключают

# ===== add in nginx.conf

log_format upstream_time '$remote_addr - $remote_user [$time_local] '
                          '"$request" $status $body_bytes_sent '
                          '"$http_referer" "$http_user_agent"'
                          'rt=$request_time uct="$upstream_connect_time" uht="$upstream_header_time" urt="$upstream_response_time"';

# свои пути можно назначить так
error_log nginx/log/error.log warn;
access_log nginx/log/access.log upstream_time;

# отключить логи
error_log off;
access_log off;

# пути логов по умолчанию
/var/log/nginx/error.log          
/var/log/nginx/access.log      


# ==============================================================================================================================
# NGINX IN DOCKER
# ==============================================================================================================================
# https://hub.docker.com/_/nginx

# ===== DOCKERFILE

FROM nginx:latest

# удаляем дефолтный конфиг в контейнере и добавляем свой
RUN rm /etc/nginx/conf.d/default.conf
ADD nginx.conf /etc/nginx/conf.d


# ==============================================================================================================================
# NGINX БЕЗ DOWNTIME (HOT RELOAD) 
# ==============================================================================================================================

# 1. ПРОВЕРКА НОВОГО КОНФИГА ПЕРЕД ЗАПУСКОМ (синаксис + работоспособность)
sudo nginx -t

# 2. ПЕРЕЗАПУСК СЕРВЕРА
sudo service nginx reload
# nginx дождется завершения текущих процессов
# перезагрузит сервер так чтобы downtime=0


# ==============================================================================================================================
# NGINX Monitoring Amplify
# ==============================================================================================================================
# https://amplify.nginx.com/signup/














